USE internet_tv;

INSERT INTO programs (title, description) VALUES
    ('番組A', '番組Aの説明文'),
    ('番組B', '番組Bの説明文'),
    ('番組C', '番組Cの説明文'),
    ('番組D', '番組Dの説明文'),
    ('番組E', '番組Eの説明文'),
    ('番組F', '番組Fの説明文'),
    ('番組G', '番組Gの説明文'),
    ('番組H', '番組Hの説明文'),
    ('番組I', '番組Iの説明文'),
    ('番組J', '番組Jの説明文');

INSERT INTO genres (name) VALUES
    ('ジャンルA'),
    ('ジャンルB'),
    ('ジャンルC'),
    ('ジャンルD'),
    ('ジャンルE'),
    ('ジャンルF'),
    ('ジャンルG'),
    ('ジャンルH'),
    ('ジャンルI'),
    ('ジャンルJ');

INSERT INTO program_genres (program_id, genre_id) VALUES
    (1, 1),
    (1, 2),
    (1, 3),
    (2, 4),
    (2, 5),
    (3, 6),
    (3, 7),
    (4, 8),
    (4, 9),
    (5, 10);

INSERT INTO channels (name) VALUES
    ('Channel A'),
    ('Channel B'),
    ('Channel C'),
    ('Channel D'),
    ('Channel E');


INSERT INTO programs_seasons (program_id, season_number) VALUES
    (1, 1),
    (1, 2),
    (2, 1),
    (2, 2),
    (2, 3),
    (3, NULL),
    (4, NULL),
    (5, NULL),
    (6, NULL),
    (7, NULL),
    (8, NULL),
    (9, NULL),
    (10, NULL);

INSERT INTO episodes (episode_number, title, description, duration, release_date, views, program_season_id) VALUES
    (1, '番組A 1-1', 'Description 1-1', 30, '2023-01-01', 10000, 1),
    (2, '番組A 1-2', 'Description 1-2', 30, '2023-01-02', 15000, 1),
    (1, '番組A 2-1', 'Description 2-1', 45, '2023-01-03', 20000, 2),
    (2, '番組A 2-2', 'Description 2-2', 45, '2023-01-04', 10000, 2),
    (1, '番組B 1-1', 'Description 1-1', 60, '2023-01-01', 30000, 3),
    (2, '番組B 1-2', 'Description 1-2', 60, '2023-01-02', 30000, 3),
    (1, '番組B 2-1', 'Description 2-1', 30, '2023-01-03', 20000, 4),
    (2, '番組B 2-2', 'Description 2-2', 30, '2023-01-04', 10000, 4),
    (1, '番組B 3-1', 'Description 3-1', 30, '2023-01-05', 60000, 5),
    (2, '番組B 3-2', 'Description 3-1', 30, '2023-02-06', 70000, 5),
    (1, '番組C', 'Description C', 60, '2023-01-01', 5000, 6),
    (1, '番組D', 'Description D', 60, '2023-01-01', 5000, 7),
    (1, '番組E', 'Description E', 60, '2023-01-02', 15000, 8),
    (1, '番組F', 'Description F', 60, '2023-01-02', 75000, 9),
    (1, '番組G', 'Description G', 60, '2023-01-03', 35000, 10),
    (1, '番組H', 'Description H', 60, '2023-01-03', 2000, 11),
    (1, '番組I', 'Description I', 60, '2023-01-04', 200, 12),
    (1, '番組J', 'Description J', 60, '2023-01-04', 25000, 13);

INSERT INTO program_slots (start_time, end_time, channel_id, episode_id, views) VALUES
    ('2023-01-01 09:00:00', '2023-01-01 09:30:00', 1, 1, 2000),
    ('2023-01-01 09:00:00', '2023-01-01 10:00:00', 2, 5, 6000),
    ('2023-01-01 09:00:00', '2023-01-01 10:00:00', 3, 11, 1000),
    ('2023-01-01 09:00:00', '2023-01-01 09:30:00', 4, 12, 1000),
    ('2023-01-02 09:00:00', '2023-01-02 09:30:00', 1, 2, 3000),
    ('2023-01-02 09:00:00', '2023-01-02 10:00:00', 2, 6, 6000),
    ('2023-01-02 09:00:00', '2023-01-02 10:00:00', 3, 13, 30000),
    ('2023-01-02 09:00:00', '2023-01-02 10:00:00', 4, 14, 15000),
    ('2023-01-03 09:00:00', '2023-01-03 09:45:00', 1, 3, 4000),
    ('2023-01-03 09:00:00', '2023-01-03 09:30:00', 2, 7, 4000),
    ('2023-01-03 09:00:00', '2023-01-03 10:00:00', 3, 15, 7000),
    ('2023-01-03 09:00:00', '2023-01-03 10:00:00', 4, 16, 400),
    ('2023-01-04 09:00:00', '2023-01-04 10:45:00', 1, 4, 2000),
    ('2023-01-04 09:00:00', '2023-01-04 09:30:00', 2, 8, 2000),
    ('2023-01-04 09:00:00', '2023-01-04 10:00:00', 3, 17, 40),
    ('2023-01-04 09:00:00', '2023-01-04 10:00:00', 4, 18, 5000),
    ('2023-01-05 09:00:00', '2023-01-05 09:30:00', 5, 9, 12000),
    ('2023-01-06 09:00:00', '2023-01-06 09:30:00', 5, 10, 14000);